ibwahdan/STM32_Keypad_Password/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdint.h>
#include "stm32f4xx_hal_tim.h"


void handle_button_press(void); //toggles PA5 and sends button press message
void send_uart_message(char *msg);
void toggle_led(void);

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

#define SH1107_ADDR 0x3C //OLED I2C Address
#define MAX_PASS_LENGTH 8


/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void toggle_led(void) { //Activate/Toggle LED
    HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
}

void send_uart_message(char *msg) { //Send Message through UART
    HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
}

void handle_button_press(void) { //Button Press actions
    toggle_led();
    HAL_Delay(200); // debounce
}


/* Buzzer PWM Functions */
void buzzer_on(void) {
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 250); //Duty Cycle - 50%
}

void buzzer_off(void) {
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 0); //Duty Cycle - 0% (off)
}





/* OLED Command Functions */
// Function to send a command to the OLED
void SH1107_Write_Command(uint8_t cmd) {
    uint8_t buffer[2] = {0x00, cmd}; // 0x00 = command
    HAL_I2C_Master_Transmit(&hi2c1, SH1107_ADDR << 1, buffer, 2, HAL_MAX_DELAY);
}

void SH1107_Write_Data(uint8_t data) {
    uint8_t buffer[2] = {0x40, data}; // 0x40 = data
    HAL_I2C_Master_Transmit(&hi2c1, SH1107_ADDR << 1, buffer, 2, HAL_MAX_DELAY);
}

void SH1107_Init(void) {
    HAL_Delay(100);

    SH1107_Write_Command(0xAE); // Display OFF
    SH1107_Write_Command(0xDC); // Set display start line
    SH1107_Write_Command(0x00);
    SH1107_Write_Command(0x81); // Set contrast control
    SH1107_Write_Command(0x2F);
    SH1107_Write_Command(0x20); // Set memory addressing mode
    SH1107_Write_Command(0xA0); // Segment remap
    SH1107_Write_Command(0xC0); // COM scan direction normal
    SH1107_Write_Command(0xA8); // Set multiplex ratio
    SH1107_Write_Command(0x7F); // 128MUX
    SH1107_Write_Command(0xD3); // Display offset
    SH1107_Write_Command(0x60); // Suggested for 128x128
    SH1107_Write_Command(0xD5); // Display clock divide
    SH1107_Write_Command(0x50);
    SH1107_Write_Command(0xD9); // Set pre-charge
    SH1107_Write_Command(0x22);
    SH1107_Write_Command(0xDB); // Set VCOMH Deselect Level
    SH1107_Write_Command(0x35);
    SH1107_Write_Command(0xAD); // Charge Pump
    SH1107_Write_Command(0x8A);
    SH1107_Write_Command(0xAF); // Display ON
}


void SH1107_Clear(void) {
    for (int page = 0; page < 8; page++) {
        SH1107_Write_Command(0xB0 + page); // Page address
        SH1107_Write_Command(0x00);        // Lower column start
        SH1107_Write_Command(0x10);        // Upper column start
        for (int col = 0; col < 128; col++) {
            SH1107_Write_Data(0x00);       // Blank
        }
    }
}

const uint8_t font5x7[][5] = {
    // SPACE (ASCII 32)
    [0] = {0x00, 0x00, 0x00, 0x00, 0x00}, // ' '
    ['!' - 32] = {0x00, 0x00, 0x5F, 0x00, 0x00}, // !
    ['"' - 32] = {0x00, 0x07, 0x00, 0x07, 0x00}, // "
    ['#' - 32] = {0x14, 0x7F, 0x14, 0x7F, 0x14}, // #
    ['$' - 32] = {0x24, 0x2A, 0x7F, 0x2A, 0x12}, // $
    ['%' - 32] = {0x23, 0x13, 0x08, 0x64, 0x62}, // %
    ['&' - 32] = {0x36, 0x49, 0x55, 0x22, 0x50}, // &
    ['\'' - 32] = {0x00, 0x05, 0x03, 0x00, 0x00}, // '
    ['(' - 32] = {0x00, 0x1C, 0x22, 0x41, 0x00}, // (
    [')' - 32] = {0x00, 0x41, 0x22, 0x1C, 0x00}, // )
    ['*' - 32] = {0x14, 0x08, 0x3E, 0x08, 0x14}, // *
    ['+' - 32] = {0x08, 0x08, 0x3E, 0x08, 0x08}, // +
    [',' - 32] = {0x00, 0x50, 0x30, 0x00, 0x00}, // ,
    ['-' - 32] = {0x08, 0x08, 0x08, 0x08, 0x08}, // -
    ['.' - 32] = {0x00, 0x60, 0x60, 0x00, 0x00}, // .
    ['/' - 32] = {0x20, 0x10, 0x08, 0x04, 0x02}, // /

    // A–Z
    ['A' - 32] = {0x7E, 0x11, 0x11, 0x11, 0x7E},
    ['B' - 32] = {0x7F, 0x49, 0x49, 0x49, 0x36},
    ['C' - 32] = {0x3E, 0x41, 0x41, 0x41, 0x22},
    ['D' - 32] = {0x7F, 0x41, 0x41, 0x22, 0x1C},
    ['E' - 32] = {0x7F, 0x49, 0x49, 0x49, 0x41},
    ['F' - 32] = {0x7F, 0x09, 0x09, 0x09, 0x01},
    ['G' - 32] = {0x3E, 0x41, 0x49, 0x49, 0x7A},
    ['H' - 32] = {0x7F, 0x08, 0x08, 0x08, 0x7F},
    ['I' - 32] = {0x00, 0x41, 0x7F, 0x41, 0x00},
    ['J' - 32] = {0x20, 0x40, 0x41, 0x3F, 0x01},
    ['K' - 32] = {0x7F, 0x08, 0x14, 0x22, 0x41},
    ['L' - 32] = {0x7F, 0x40, 0x40, 0x40, 0x40},
    ['M' - 32] = {0x7F, 0x02, 0x0C, 0x02, 0x7F},
    ['N' - 32] = {0x7F, 0x04, 0x08, 0x10, 0x7F},
    ['O' - 32] = {0x3E, 0x41, 0x41, 0x41, 0x3E},
    ['P' - 32] = {0x7F, 0x09, 0x09, 0x09, 0x06},
    ['Q' - 32] = {0x3E, 0x41, 0x51, 0x21, 0x5E},
    ['R' - 32] = {0x7F, 0x09, 0x19, 0x29, 0x46},
    ['S' - 32] = {0x46, 0x49, 0x49, 0x49, 0x31},
    ['T' - 32] = {0x01, 0x01, 0x7F, 0x01, 0x01},
    ['U' - 32] = {0x3F, 0x40, 0x40, 0x40, 0x3F},
    ['V' - 32] = {0x1F, 0x20, 0x40, 0x20, 0x1F},
    ['W' - 32] = {0x7F, 0x20, 0x18, 0x20, 0x7F},
    ['X' - 32] = {0x63, 0x14, 0x08, 0x14, 0x63},
    ['Y' - 32] = {0x07, 0x08, 0x70, 0x08, 0x07},
    ['Z' - 32] = {0x61, 0x51, 0x49, 0x45, 0x43},
};



void SH1107_Set_Cursor(uint8_t page, uint8_t col) {
    SH1107_Write_Command(0xB0 + page);             // Set page address
    SH1107_Write_Command(col & 0x0F);              // Set lower column address
    SH1107_Write_Command(0x10 | (col >> 4));       // Set higher column address
}

void SH1107_Write_Char(char c) {
    if (c < 32 || c > 126) c = ' '; // fallback to space
    const uint8_t *bitmap = font5x7[c - 32];
    for (int i = 0; i < 5; i++) {
        SH1107_Write_Data(bitmap[i]);
    }
    SH1107_Write_Data(0x00); // Space between characters
}

void SH1107_Write_String(const char* str) {
    while (*str) {
        SH1107_Write_Char(*str++);
    }
}

void SH1107_Unlock_Animation(void) {
    for (int page = 0; page < 8; page++) {  // SH1107 usually has 8 pages (each 8px tall)
        SH1107_Set_Cursor(0, page);
        for (int col = 0; col < 128; col++) {
            SH1107_Write_Data(0xFF);  // Fill this line
            HAL_Delay(1);             // Delay for visual effect
        }
    }
    HAL_Delay(500);
    SH1107_Clear();
}


uint32_t  buttonCount = 0;

/* Servo Functions*/
void servo_set_angle(uint8_t angle) {
	 if (angle > 180) angle = 180;
	 uint16_t pulse = ((angle * 1000) / 180) + 1000;  // maps 0–180° to 1000–2000
	 __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, pulse);
}


