ibwahdan/STM32_Keypad_Password/Core/Src/main.c
/* Keypad Functions */


char password[MAX_PASS_LENGTH + 1] = "1234#";  // Example password
char input[MAX_PASS_LENGTH + 1] = {0};
uint8_t input_index = 0;
uint8_t failed_entry = 0;

void keypad_password() {
    GPIO_TypeDef* row_ports[4] = {GPIOA, GPIOB, GPIOB, GPIOB};
    uint16_t row_pins[4] = {GPIO_PIN_8, GPIO_PIN_10, GPIO_PIN_4, GPIO_PIN_5};

    GPIO_TypeDef* col_ports[4] = {GPIOA, GPIOB, GPIOC, GPIOC};
    uint16_t col_pins[4] = {GPIO_PIN_4, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0};

    const char keypad_map[4][4] = {
        {'1', '2', '3', 'A'},
        {'4', '5', '6', 'B'},
        {'7', '8', '9', 'C'},
        {'*', '0', '#', 'D'}
    };

 //   char msg[32];

    for (int r = 0; r < 4; r++) {
        // Set all rows HIGH
        for (int i = 0; i < 4; i++) {
            HAL_GPIO_WritePin(row_ports[i], row_pins[i], GPIO_PIN_SET);
        }

        // Set current row LOW
        HAL_GPIO_WritePin(row_ports[r], row_pins[r], GPIO_PIN_RESET);
        HAL_Delay(1);  // debounce

        // Check each column
        for (int c = 0; c < 4; c++) {
            if (HAL_GPIO_ReadPin(col_ports[c], col_pins[c]) == GPIO_PIN_RESET) {
                char key = keypad_map[r][c];


                // Debounce
                while (HAL_GPIO_ReadPin(col_ports[c], col_pins[c]) == GPIO_PIN_RESET);
                HAL_Delay(100);

                // Beep
                buzzer_on();
                HAL_Delay(100);
                buzzer_off();


                // Save Key
                if (input_index <MAX_PASS_LENGTH) {
                	input[input_index++] = key;
                	input[input_index] = '\0'; //Null-terminate
                }

                // OLED Display
                SH1107_Clear();
                SH1107_Set_Cursor(0,0);
                for (uint8_t i = 0; i < input_index; i++) {
                	SH1107_Write_Char('*');
                }

                // Check if full length entered
                if (input_index == strlen(password)) {
                    if (strcmp(input, password) == 0) {
                    	SH1107_Clear();
                        SH1107_Set_Cursor(0, 0);
                        SH1107_Write_String("UNLOCKED!");
                        send_uart_message("Correct password!\r\n");
                        servo_set_angle(90);  // Open
                        failed_entry = 0;
                        for(int i = 0; i < 5; i++) { // Five Beeps for successful entry
                        	buzzer_on();
                        	HAL_Delay(100);
                        	buzzer_off();
                        	HAL_Delay(100);
                        }
                    } else {
                    	SH1107_Clear();
                    	SH1107_Set_Cursor(0, 0);
                    	SH1107_Write_String("ACCESS DENIED");
                    	send_uart_message("Wrong password!\r\n");
                    	servo_set_angle(180);  // Lock
                    	failed_entry++;
                    	for(int i = 0; i < 2; i++){
                    		buzzer_on();
                    		HAL_Delay(100);
                    		buzzer_off();
                    		HAL_Delay(100);
                    	}
                    }

                    // Reset input
                    memset(input, 0, sizeof(input));
                    input_index = 0;

                    HAL_Delay(1000);
                    SH1107_Clear();
                }

                if (failed_entry >= 3) {
                	SH1107_Clear();
                	SH1107_Set_Cursor(0, 0);
                	SH1107_Write_String("LOCKED OUT");
                	send_uart_message("LOCKED OUT FOR TOO MANY FAILED ENTRIES!\r\n");
                	for(int i = 0; i < 10; i++){
                		buzzer_on();
                		HAL_Delay(300);
                		buzzer_off();
                		HAL_Delay(300);
                	}
                	failed_entry = 0;
                }

                return;
            }
        }
    }
}





/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM3_Init();
  MX_I2C1_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1); // Start PWM TIM3_CH1
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2); // Start PWM TIM1_CH2


/*  for (uint8_t addr = 0x3C; addr <= 0x3F; addr++) {
      if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 3, 100) == HAL_OK) {
          char buf[32];
          sprintf(buf, "I2C device found at 0x%02X\r\n", addr);
          send_uart_message(buf);
      } else {
          char buf[32];
          sprintf(buf, "No device at 0x%02X\r\n", addr);
          send_uart_message(buf);
      }
  } */

  SH1107_Init();
  SH1107_Clear();


  // Fill first page with solid pixels
/*  for (uint8_t page = 0; page < 8; page++) {
      SH1107_Write_Command(0xB0 + page); // Set page address
      SH1107_Write_Command(0x02);        // Set lower column address
      SH1107_Write_Command(0x10);        // Set higher column address

      for (uint8_t col = 0; col < 128; col++) {
          SH1107_Write_Data(0xFF);       // White pixels
      }
  }*/



  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	  keypad_password();
	  	  /* Toggle LED Pin if button is pressed  */
	  if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_RESET) {
		  handle_button_press();
		  servo_set_angle(0);    // Far left
		  SH1107_Clear();
		  SH1107_Set_Cursor(0, 0); //page 0 column 0
		  buttonCount++;
		  if(buttonCount >= 5 && buttonCount < 8) {
			  SH1107_Unlock_Animation();
			  SH1107_Set_Cursor(0, 0);
			  send_uart_message("FIVES!\r\n");
			  servo_set_angle(90);   // Center
			  for(int i = 0; i < 5; i++) {
				  buzzer_on();
				  HAL_Delay(100);
				  buzzer_off();
				  HAL_Delay(100);
				  servo_set_angle(20);
				  HAL_Delay(100);
			  }
		  } else {
			  buzzer_on();
			  HAL_Delay(100);
			  buzzer_off();
			  send_uart_message("BUTTON!\r\n");
			  servo_set_angle(180);  // Far right

